Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: When the stroke parameters do not change, the previously generated stroke parameters are automatically retrieved from the cache to improve rendering performance.
it_it: Se i parametri del tratto non cambiano, i parametri del tratto generati in precedenza vengono recuperati automaticamente dalla cache per migliorare le prestazioni di rendering.

source: When the subscribing occurs, and each time the Subject's value is changed thereafter, the Subject's value is compared to a reference value of ``0``, and the :cpp:enumerator:`LV_STATE_CHECKED` state is:
it_it: Quando si verifica la sottoscrizione, e ogni volta che il valore del Subject viene modificato successivamente, il valore del Subject viene confrontato con un valore di riferimento di ``0``, e lo stato :cpp:enumerator:`LV_STATE_CHECKED` è:

source: When the subscribing occurs, and each time the Subject's value is changed thereafter, the Subject's value is compared with the specified reference value, and the specified flag(s) is (are):
it_it: Quando si verifica la sottoscrizione, e ogni volta che il valore del Subject viene modificato successivamente, il valore del Subject viene confrontato con il valore di riferimento specificato e il/i flag specificato/i è/sono:

source: When the subscribing occurs, and each time the Subject's value is changed thereafter, the Subject's value is compared with the specified reference value, and the specified state(s) is (are):
it_it: Quando avviene la sottoscrizione, e ogni volta che il valore del Subject viene modificato successivamente, tale valore viene confrontato con quello di riferimento specificato e lo stato/gli stati specificati sono:

source: When the subscription occurs, and each time the Subject's value is changed thereafter, the Subject's value is used to update the Label's text as follows:
it_it: Quando si verifica la sottoscrizione, e ogni volta che il valore del Subject viene modificato in seguito, il valore del Subject viene utilizzato per aggiornare il testo della Label in questo modo:

source: When the term "layer" is used in LVGL documentation, it may refer to one of several things:
it_it: Quando il termine "layer" viene utilizzato nella documentazione LVGL, può riferirsi a diversi aspetti:

source: When the user clicks somewhere and then turns the rotary, the last clicked widget will either be scrolled or its value will be incremented/decremented (e.g., in the case of a slider).
it_it: Quando l'utente clicca in un punto qualsiasi e poi ruota la ghiera, l'ultimo widget cliccato verrà fatto scorrere oppure il suo valore verrà incrementato/decrementato (ad esempio, nel caso di uno slider).

source: When the user scrolls a Widget and releases it, LVGL can emulate inertial momentum for the scrolling.
it_it: Quando l'utente scorre un widget e lo rilascia, LVGL può emulare lo slancio inerziale per lo scorrimento.

source: When the user selects a new value, the list is deleted again.
it_it: Quando l'utente seleziona un nuovo valore, l'elenco viene nuovamente eliminato.

source: When they are called :cpp:type:`lv_draw_task_t` objects are created internally.
it_it: Quando vengono chiamate, gli oggetti :cpp:type:`lv_draw_task_t` vengono creati internamente.

source: When this is done, a change to the value of any of the Subjects in the group triggers a notification to all Observers subscribed to the Subject Group (e.g. ``subject_all``).
it_it: Una volta fatto questo, una modifica al valore di uno qualsiasi dei Subject del gruppo attiva una notifica a tutti gli Observer iscritti al Gruppo Subject (ad esempio ``subject_all``).

source: When this is the case, :cpp:func:`lv_timer_handler` calls :cpp:func:`lv_lock()` and :cpp:func:`lv_unlock()` internally, so you do not have to bracket your calls to :cpp:func:`lv_timer_handler` with them.
it_it: In questo caso, :cpp:func:`lv_timer_handler` chiama internamente :cpp:func:`lv_lock()` e :cpp:func:`lv_unlock()`, quindi non si devono includere le chiamate a :cpp:func:`lv_timer_handler` tra di esse.

source: When this is the case, only the ``getter`` field in the corresponding array element will be initialized with a function pointer.
it_it: In questo caso, solo il campo ``getter`` nell'elemento dell'array corrispondente verrà inizializzato con un puntatore a funzione.

source: When this option is enabled:
it_it: Quando questa opzione è abilitata:

source: When used as a type, a ``+`` suffix means multiple values can be selected and ORed.
it_it: Se utilizzato come tipo, il suffisso ``+`` consente di selezionare più valori e di combinarli con OR.

source: When used, "value" and "mode" are ignored.
it_it: Quando vengono utilizzati, "value" e "mode" vengono ignorati.

source: When using C++, prefer :cpp:expr:`lv_event_get_target_obj(e)` over :cpp:expr:`lv_event_get_target(e)` when you know the target is a Widget, as it returns the correct type without requiring a cast.
it_it: Quando si utilizza C++, preferire :cpp:expr:`lv_event_get_target_obj(e)` a :cpp:expr:`lv_event_get_target(e)` quando si sa che il target è un Widget, poiché restituisce il tipo corretto senza richiedere un cast.

source: When using DRM without EGL, the driver will always use the preferred display mode.
it_it: Quando si utilizza DRM senza EGL, il driver utilizzerà sempre la modalità di visualizzazione preferita.

source: When using LVGL's UI Editor, images can be added to ``globals.xml`` using the ``<data>`` tag instead of ``<file>``.
it_it: Quando si utilizza l'editor dell'interfaccia utente di LVGL, le immagini possono essere aggiunte a ``globals.xml`` utilizzando il tag ``<data>`` invece di ``<file>``.

source: When using LVGL's translation module, you can bind a translation tag to a label directly with :cpp:expr:`lv_label_set_translation_tag(label, tag)`.
it_it: Quando si usa il modulo di traduzione di LVGL, è possibile associare un tag di traduzione a un'etichetta direttamente con :cpp:expr:`lv_label_set_translation_tag(label, tag)`.

source: When using a C++ compiler, you must cast the result:
it_it: Quando si utilizza un compilatore C++, è necessario eseguire il cast del risultato:

source: When using multiple physical displays, you can control which display a fullscreen window appears on by assigning it to a specific physical display before entering fullscreen mode.
it_it: Quando si utilizzano più display fisici, è possibile controllare su quale display viene visualizzata una finestra a schermo intero assegnandola a un display fisico specifico prima di entrare in modalità "fullscreen".

source: When using the LovyanGFX interface, you need to add the following to your ``platformio.ini``:
it_it: Quando si utilizza l'interfaccia LovyanGFX, è necessario aggiungere quanto segue al file ``platformio.ini``:

source: When using the root node, the local position will equal the world position, meaning you can subscribe to :cpp:func:`lv_gltf_model_node_add_event_cb` instead of :cpp:func:`lv_gltf_model_node_add_event_cb_with_world_position` and use :cpp:func:`lv_gltf_model_node_get_local_position` to get the world position without the computational overhead of matrix calculations.
it_it: Quando si utilizza il nodo radice, la posizione locale sarà uguale alla posizione del "world", il che significa che è possibile iscriversi a :cpp:func:`lv_gltf_model_node_add_event_cb` invece di :cpp:func:`lv_gltf_model_node_add_event_cb_with_world_position` e utilizzare :cpp:func:`lv_gltf_model_node_get_local_position` per ottenere la posizione del "world" senza il sovraccarico computazionale dei calcoli della matrice.

source: When using this method of subscribing, it is the responsibility of the user to call :cpp:expr:`lv_observer_remove(observer)` when the Observer is no longer needed, which both unsubscribes it from the Subject and deletes it from the LVGL heap.
it_it: Quando si utilizza questo metodo di iscrizione, è responsabilità dell'utente chiamare :cpp:expr:`lv_observer_remove(observer)` quando l'Observer non è più necessario, la quale annulla l'iscrizione al Subject e lo elimina dall'heap LVGL.

source: When you call :cpp:expr:`lv_anim_start(&anim_template)` passing the *template* you have set up, it uses your template to dynamically allocate an internal object that is a *live, running* Animation.
it_it: Quando si chiama :cpp:expr:`lv_anim_start(&anim_template)` passando il *template* impostato, questa utilizza il template per allocare dinamicamente un oggetto interno che è un'Animazione *in esecuzione*.

source: When you click the button Widget, you want it to open up a new Page, use :cpp:expr:`lv_menu_set_load_page_event(menu, btn, new page)`.
it_it: Quando si clicca sul Widget pulsante, si vuole che si apra una nuova Pagina, si usa :cpp:expr:`lv_menu_set_load_page_event(menu, btn, new page)`.

source: When you press and release the encoder on a simple "non-editable" object (like a button), it will be clicked.
it_it: Quando si preme e si rilascia l'encoder su un semplice oggetto "non modificabile" (come un pulsante), questo verrà cliccato.

source: When you release it, the :cpp:enumerator:`LV_STATE_PRESSED` state will be removed while the :cpp:enumerator:`LV_STATE_FOCUSED` state remains active.
it_it: Quando lo si rilascia, lo stato :cpp:enumerator:`LV_STATE_PRESSED` verrà rimosso, mentre lo stato :cpp:enumerator:`LV_STATE_FOCUSED` rimarrà attivo.

source: When you set :c:macro:`LV_LOG_LEVEL` to a certain level, only messages with that level or higher priority (less verbose) will be logged.
it_it: Quando si imposta :c:macro:`LV_LOG_LEVEL` su un determinato livello, verranno loggati solo i messaggi con quel livello o una priorità superiore (meno dettagliati).

source: When you use more images than available cache size, LVGL can't cache all the images.
it_it: Quando si utilizzano più immagini rispetto alla dimensione disponibile della cache, LVGL non può memorizzarle tutte nella cache.

source: Where ``buffer`` is a static buffer (not just a local variable) to hold the image of the Canvas.
it_it: Dove ``buffer`` è un buffer statico (non una semplice variabile locale) per contenere l'immagine del Canvas.

source: Where can I ask questions?
it_it: Dove posso porre domande?

source: Where can I find more information?
it_it: Dove si possono trovare maggiori informazioni?

source: Where is ``LV_OS_NUTTX``?
it_it: Dov'è ``LV_OS_NUTTX``?

source: Where possible, try to avoid bezier type animations
it_it: Se possibile, cercare di evitare animazioni di tipo Bézier

source: Where the LVGL simulator uses the installed rlottie lib, the IDF works best when using rlottie as a submodule under the components directory.
it_it: Se il simulatore LVGL utilizza la libreria rlottie installata, l'IDF funziona al meglio quando si utilizza rlottie come sottomodulo nella directory components.

source: Where to Use the Drawing API
it_it: Dove Utilizzare l'API di Disegno

source: Where to go from here?
it_it: Come procedere?

source: Where:
it_it: Dove:

source: Whether a widget is editable is set in the widget's class.
it_it: La modificabilità di un widget è definita nella classe del widget.

source: Whether in families, businesses, or education, the Chinese calendar plays an irreplaceable role, enabling people to better understand and appreciate the charm of Chinese traditional culture.
it_it: Che si tratti di famiglia, lavoro o istruzione, il calendario cinese svolge un ruolo insostituibile, consentendo alle persone di comprendere e apprezzare meglio il fascino della cultura tradizionale cinese.

source: Whether or not you choose to use NuttX's ``malloc`` depends on whether you want LVGL to allocate from the NuttX global heap or use its own.
it_it: La scelta di utilizzare ``malloc`` di NuttX dipende dal fatto che si desideri che LVGL allochi dall'heap globale di NuttX o utilizzi il proprio.

source: Whether the XML was written manually or by the UI |nbsp| Editor, the files defining Components can be registered in LVGL, and after that, instances can be created.
it_it: Che l'XML sia stato scritto manualmente o dall'UI |nbsp| Editor, i file che definiscono i Componenti possono essere registrati in LVGL e, successivamente, possono essere create istanze.

source: Which Library
it_it: Quale Libreria

source: While Doxygen knows to use C color-coding of code blocks in a .C file, the downstream part of the documentation generation sequence does not, so the ``{.c}`` appendage to the ``@code`` command is necessary.
it_it: Mentre Doxygen sa utilizzare la codifica a colori C per i blocchi di codice in un file .C, la parte a valle della sequenza di generazione della documentazione non lo fa, quindi l'aggiunta di ``{.c}`` al comando ``@code`` è necessaria.

source: While Widgets can have complex ``set``/``get`` APIs, Components are very simple.
it_it: Mentre i widget possono avere API ``set``/``get`` complesse, i Componenti sono molto semplici.

source: While collecting Draw Tasks LVGL frequently dispatches the collected Draw Tasks to their assigned Draw Units.
it_it: Durante la raccolta delle Draw Task, LVGL le invia frequentemente alle Draw Unit assegnate.

source: While each :ref:`display` object can have any number of Screen Widgets associated with it, only one of those Screens is considered "Active" at any given time.
it_it: Sebbene a ogni oggetto :ref:`display` possa essere associato un numero qualsiasi di Widget Screen, solo uno di questi Screen è considerato "Attivo" in un dato momento.

source: While editing XML, |lvglpro| has a powerful auto-completion-enabled user interface, which makes defining, editing and validating UI components a breeze.
it_it: Durante la modifica di XML, |lvglpro| dispone di una potente interfaccia utente con auto-completamento, che semplifica la definizione, la modifica e la convalida dei componenti dell'interfaccia utente.

source: While having a valid subscription, there is no limit on the viewers.
it_it: Finché si ha un abbonamento valido, non ci sono limiti al numero di visitatori.

source: While it is acceptable to use a blocking implementation for the pixel transfer as well, performance will suffer.
it_it: Sebbene sia accettabile utilizzare un'implementazione bloccante anche per il trasferimento dei pixel, le prestazioni ne risentiranno.

source: While the Top Layer and System Layer are created by their owning :ref:`display` as not scroll-able and not click-able, these behaviors can be overridden the same as any other Widget by using :cpp:expr:`lv_obj_set_scrollbar_mode(scr1, LV_SCROLLBAR_MODE_xxx)` and :cpp:expr:`lv_obj_add_flag(scr1, LV_OBJ_FLAG_CLICKABLE)` respectively.
it_it: Mentre il Layer Superiore e quello di Sistema vengono creati dal rispettivo :ref:`display` come non scorrevoli e non cliccabili, questi comportamenti possono essere sovrascritti come per qualsiasi altro Widget utilizzando rispettivamente :cpp:expr:`lv_obj_set_scrollbar_mode(scr1, LV_SCROLLBAR_MODE_xxx)` e :cpp:expr:`lv_obj_add_flag(scr1, LV_OBJ_FLAG_CLICKABLE)`.

source: While the above behaviors can be combined by bit-wise OR-ing the above values together, :cpp:enumerator:`LV_GRIDNAV_CTRL_HORIZONTAL_MOVE_ONLY` and :cpp:enumerator:`LV_GRIDNAV_CTRL_VERTICAL_MOVE_ONLY` should not be used together.
it_it: Sebbene i comportamenti sopra descritti possano essere combinati tramite l'operazione OR bit per bit dei valori sopra indicati, :cpp:enumerator:`LV_GRIDNAV_CTRL_HORIZONTAL_MOVE_ONLY` e :cpp:enumerator:`LV_GRIDNAV_CTRL_VERTICAL_MOVE_ONLY` non devono essere utilizzati insieme.

source: While the chip-specific drivers do their best to initialize the LCD controller correctly, it is possible, that different TFT panels need different configurations.
it_it: Sebbene i driver specifici per chip facciano del loro meglio per inizializzare correttamente il controller LCD, è possibile che diversi pannelli TFT richiedano configurazioni diverse.

source: While the configuration is set this way, some system performance statistics (including CPU load) will appear on the display in a partially-transparent label whose location is set by the :c:macro:`LV_USE_PERF_MONITOR_POS` macro.
it_it: Mentre la configurazione è impostata in questo modo, alcune statistiche sulle prestazioni del sistema (incluso il carico della CPU) appariranno sul display in un'etichetta parzialmente trasparente la cui posizione è impostata dalla macro :c:macro:`LV_USE_PERF_MONITOR_POS`.

source: While the cursor is anywhere within the :ref:`Editor Pane`:
it_it: Mentre il cursore si trova in un punto qualsiasi del :ref:`Editor Pane`:

source: While the cursor is within an attribute's value:
it_it: Mentre il cursore si trova all'interno del valore di un attributo:

source: While the examples below show saving a reference to the created Observer objects for the various ``lv_..._bind_...()`` functions, it is not necessary to do so unless you need them for some purpose, because the created Observer objects will be automatically deleted when the Widget is deleted.
it_it: Sebbene gli esempi seguenti mostrino il salvataggio di un riferimento agli oggetti Observer creati per le varie funzioni ``lv_..._bind_...()``, non è necessario farlo a meno che non lo siano per qualche scopo, poiché gli oggetti Observer creati verranno eliminati automaticamente quando il Widget viene eliminato.

source: While the process will be demonstrated for the Raspberry Pi 3 (64-bit), it can be applied to any board in a similar way.
it_it: Sebbene il processo verrà illustrato per Raspberry Pi 3 (64 bit), può essere applicato a qualsiasi board in modo simile.

source: While this is great for security, an embedded application will obviously need `access to the hardware.
it_it: Sebbene questo sia ottimo per la sicurezza, un'applicazione embedded avrà ovviamente bisogno di `accesso all'hardware.

source: While unnecessary, removing the ``rlottie/rlottie/example`` folder can remove many un-needed files for this embedded LVGL application.
it_it: Sebbene non necessaria, la rimozione della cartella ``rlottie/rlottie/example`` può rimuovere molti file non necessari per questa applicazione LVGL embedded.

source: While using it consumes more program space and more CPU overhead while setting and getting Widget properties, it is designed so as to minimize that additional CPU overhead.
it_it: Sebbene il suo utilizzo consumi più spazio di programma e un maggiore sovraccarico della CPU durante l'impostazione e l'ottenimento delle proprietà del Widget, è progettato in modo da ridurre al minimo tale sovraccarico aggiuntivo della CPU.

source: Why LVGL + Tasmota + Berry?
it_it: Perché LVGL + Tasmota + Berry?

source: Why MicroPython + LVGL?
it_it: Perché MicroPython + LVGL?

source: Why NuttX + LVGL?
it_it: Perché NuttX + LVGL?

source: Why PikaScript + LVGL?
it_it: Perché PikaScript + LVGL?

source: Why do I see nonsense colors on the screen?
it_it: Perché si vedono colori senza senso sullo schermo?

source: Why do I see only garbage on the screen?
it_it: Perché si vede solo spazzatura sullo schermo?

source: Why is the display driver called only once?
it_it: Perché il driver video viene chiamato una sola volta?

source: Why would you want multi-display support?
it_it: Perché si dovrebbero supportare più display?

source: Widget Architecture
it_it: Architettura del Widget

source: Widget Binding
it_it: Binding del Widget

source: Widget Creation
it_it: Creazione di Widget

source: Widget Deletion
it_it: Eliminazione del Widget

source: Widget ID
it_it: ID del Widget

source: Widget Properties
it_it: Proprietà Widget

source: Widget Properties provides a way to greatly reduce the size of the interface between LVGL and whatever logic layer is just above it, to get and set the most important properties of Widgets.
it_it: Le Proprietà Widget offrono un modo per ridurre notevolmente le dimensioni dell'interfaccia tra LVGL e qualsiasi livello logico immediatamente superiore, per ottenere e impostare le proprietà più importanti dei Widget.

source: Widget and Component properties
it_it: Proprietà di Widget e Componenti

source: Widget constructor must follow the ``lv_<widget_name>_create(lv_obj_t * parent)`` pattern.
it_it: Il costruttore del Widget deve seguire il pattern ``lv_<widget_name>_create(lv_obj_t * parent)``.

source: Widget members function must start with ``lv_<widget_name>`` and should receive :cpp:expr:`lv_obj_t *` as first argument which is a pointer to Widget object itself.
it_it: Le funzioni membro del Widget devono iniziare con ``lv_<widget_name>`` e devono ricevere :cpp:expr:`lv_obj_t *` come primo argomento, che è un puntatore all'oggetto Widget stesso.

source: Widget position or size can change by state.
it_it: La posizione o le dimensioni del widget possono cambiare in base allo stato.

source: Widget rendering typically occurs in :cpp:enumerator:`LV_EVENT_DRAW_MAIN`.
it_it: Il rendering dei Widget avviene in genere in :cpp:enumerator:`LV_EVENT_DRAW_MAIN`.

source: Widget will keep this space from its siblings in layouts.
it_it: Il Widget manterrà questo spazio rispetto ai suoi "fratelli" nei layout.

source: Widget-Specific Attributes
it_it: Attributi Specifici dei Widget

source: Widgets are built from multiple parts.
it_it: I widget sono costituiti da più parti.

source: Widgets are built from one or more *parts*.
it_it: I Widget sono costituiti da una o più *parti*.

source: Widgets are the basic building blocks of the UI.
it_it: I widget sono gli elementi costitutivi fondamentali dell'interfaccia utente.

source: Widgets can also have :ref:`local styles <style_local>` with higher precedence than "normal" styles.
it_it: I Widget possono anche avere :ref:`stili locali <style_local>` con precedenza maggiore rispetto agli stili "normali".

source: Widgets can be composed of *parts* which may each have their own styles.
it_it: I Widget possono essere composti da *parti*, ciascuna delle quali può avere i propri stili.

source: Widgets can be created and deleted dynamically at runtime.
it_it: I Widget possono essere creati ed eliminati dinamicamente a runtime.

source: Widgets can be created dynamically by calling their respective create functions.
it_it: I widget possono essere creati dinamicamente chiamando le rispettive funzioni *create*.

source: Widgets can be found by name in two ways:
it_it: I widget si possono ricercare per nome in due modi:

source: Widgets can be in a combination of the following states:
it_it: I Widget possono trovarsi in una combinazione dei seguenti stati:

source: Widgets can optionally have identifiers added to their functionality if needed for the application.
it_it: I Widget possono facoltativamente aggiungere identificatori alle loro funzionalità, se necessario per l'applicazione.

source: Width and Height
it_it: Larghezza e Altezza

source: Width and height transformation
it_it: Trasformazione di larghezza e altezza

source: Width in pixels (<= 2048)
it_it: Larghezza in pixel (<= 2048)

source: Will remove the old intermediate and build files, eliminating the orphan files that would otherwise result.
it_it: Rimuoverà i vecchi file intermedi e di build, eliminando i file orfani che altrimenti si creerebbero.

source: Window Decorations
it_it: Decorazioni per la Window

source: Window decorations (title bars, borders, close buttons, etc.) are now the responsibility of the application developer, not LVGL.
it_it: Le decorazioni per le window (barre del titolo, bordi, pulsanti di chiusura, ecc.) sono ora responsabilità dello sviluppatore dell'applicazione, non di LVGL.

source: Windows Driver
it_it: Driver Windows

source: Windows-like absolute path
it_it: Path assoluto simile a Windows

source: Windows-like relative path
it_it: Path relativo simile a Windows
